Revit 2027 API
Definitions.GetEnumerator Method
Retrieves an enumerator to the collection.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public virtual IEnumerator<Definition> GetEnumerator()
Public Overridable Function GetEnumerator As IEnumerator(Of Definition)
public:
virtual IEnumerator<Definition^>^ GetEnumerator()
abstract GetEnumerator : unit -> IEnumerator<Definition>
override GetEnumerator : unit -> IEnumerator<Definition>
Return Value
IEnumerator<Definition>
The enumerator.
Implements
IEnumerable<T>.GetEnumerator()
See Also
Reference
Definitions Class
Autodesk.Revit.DB Namespace